tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.13"
brew "autojump"
brew "bat"
brew "btop"
brew "glib"
brew "cryptography"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "ghostscript"
brew "git"
brew "guile"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "ldns"
brew "libfido2"
brew "openjdk"
brew "maven"
brew "neofetch"
brew "openjdk@21"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.12"
brew "ruby"
brew "tcl-tk"
brew "tree"
brew "wget"
brew "wimlib"
brew "yt-dlp"
brew "zsh"
brew "dockutil"

cask "1password"
cask "1password-cli"
cask "aldente"
cask "alfred"
cask "audacity"
cask "chatgpt"
cask "claude"
cask "coconutbattery"
cask "cursor"
cask "devtoys"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "itsycal"
cask "meetingbar"
cask "microsoft-edge"
cask "quicklook-json"
cask "rar"
cask "rectangle"
cask "spotify"
cask "stats"
cask "telegram"
cask "vanilla"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webpquicklook"
cask "webstorm"
cask "whatsapp"

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "apollographql.vscode-apollo"
vscode "arjun.swagger-viewer"
vscode "christian-kohler.npm-intellisense"
vscode "clemenspeters.format-json"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equimper.react-native-react-redux"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-monokai-night"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "framer.framer-syntax"
vscode "fwcd.kotlin"
vscode "github.github-vscode-theme"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "leizongmin.node-module-intellisense"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "naco-siren.gradle-language"
vscode "ngryman.codesandbox-theme"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "perragnaredin.light-plus-tweaked"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sapse.vscode-cds"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tinkertrain.theme-panda"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "yuchiu2002.default-material-dark-theme"
vscode "yzhang.markdown-all-in-one"
